depot/app/controllers/carts_controller.rb

SELECT `carts`.* FROM `carts`
---
  def index
    @carts = Cart.all

INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2019-06-28 07:39:12', '2019-06-28 07:39:12')
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

DELETE FROM `carts` WHERE `carts`.`id` = 51
---
  def destroy
    @cart.destroy if @cart.id == session[:cart_id]

SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 51 LIMIT 1
---
    def set_cart
      @cart = Cart.find(params[:id])