depot/app/controllers/orders_controller.rb

  def destroy
    @order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 980190962

    def set_order
      @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 980190962 LIMIT 1