depot/app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def new
    @hide_checkout_button = true
    if @cart.line_items.empty?
---
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 40
SELECT  1 AS one FROM `line_items` WHERE `line_items`.`cart_id` = 50 LIMIT 1

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2019-07-02 06:41:19', '2019-07-02 06:41:19')
INSERT INTO `orders` (`name`, `address`, `email`, `pay_type`, `created_at`, `updated_at`) VALUES ('Dave Thomas', '3435 ABC st', 'customer@test.com', 'Check', '2019-07-03 04:05:49', '2019-07-03 04:05:49')
DELETE FROM `carts` WHERE `carts`.`id` = 52