depot/app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$04$hKST0M9XOCabwk2Y8bhTROkF0NGXcrY7DI1mcJ0NfJ8nQNLD.i1yu', `updated_at` = '2019-07-02 08:30:57' WHERE `users`.`id` = 980190962

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 980190962 LIMIT 1