depot/app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT `users`.* FROM `users` ORDER BY `users`.`name` ASC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES ('Long', '$2a$10$NaflYWuPJ7fsjfHfSc/tKeeg9H9AW33nMHE2CG3LYjE.LuuzHMuMy', '2019-07-02 08:24:08', '2019-07-02 08:24:08')

  def destroy
    begin
      @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 2