depot/app/models/product.rb

  def self.latest
    Product.order(:updated_at).last
---
SELECT  `products`.* FROM `products` ORDER BY `products`.`updated_at` DESC LIMIT 1